/* 주소 연산식 */



/* 문법

 *

 * & 식

 *

 * 의미

 * 식이 가리키는 변수나 함수의 주소를 계산합니다.

/* 라이브러리 함수 */

/*

 * 라이브러리 함수를 쓸 때는 include 지시어의 파일 이름을 < ... > 형태로 씁니다.

 * stdio.h 헤더 파일에는 printf 함수가 선언되어 있습니다.

 * printf 함수는 문자열을 입력값으로 받아서 화면에 출력합니다.

 * 문자열을 나타낼 때는 큰 따옴표 안에 문자들을 "문자열"처럼 씁니다.
 */


int i = 0x00fecabb;

/* To Do: 디버그 창 조사식에서 i의 주소를 확인해보세요 */

/* To Do: 디버그 창 메모리에서 i가 어떻게 저장되어 있는지 확인해보세요 */

/* To Do: 디버그 창 메모리에서 i에 저장된 값이 bb ca fe 00으로 보이게 초기값을 바꿔보세요 */



/* To Do: include 지시어로 stdio.h 라이브러리 헤더 파일을 포함시켜보세요 */

#include<stdio.h>
int main() {

	return 0;
}